<h1>Data Cleaning Pandas</h1>

<h2>Problem Statement</h2>
<p>It happens all the time : someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis ?</p>
<p>Take this monstrosity as the dataframe to use in the following puzzles :</p>

```python
df =  pd.DataFrame({'From_To' : ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber' : [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays' : [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline' : ['KLM(!)', '<Air France> (12)', '(British Airways.)', '12. Air France', '''Swiss Air''']})
```
<blockquote>
    <ol>
        <li>Some values in the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).</li><br>
        <li>The From_To column would be better as two separate columns! Split each string on the underscore delimeter _ to give a new temporary DataFrame with the correct values.Assign the correct column names to this temporary DataFrame.</li><br>
        <li>Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the string so that only the first letter is uppercase (e.g. "londON" should become "London".)</li><br>
        <li>Delete the From_To column from df and attach the temporary DataFrame from the previous questions.</li><br>
        <li>In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.<br><br>Expand the series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.</li>
    </ol>
</blockquote>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df =  pd.DataFrame(
    {
        'From_To' : ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
        'FlightNumber' : [10045, np.nan, 10065, np.nan, 10085],
        'RecentDelays' : [[23, 47], [], [24, 43, 87], [13], [67, 32]],
        'Airline' : ['KLM(!)', '<Air France> (12)', '(British Airways.)', '12. Air France', '''Swiss Air''']
    }
)

In [3]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []   <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]      12. Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

<h3>Question 1</h3>
<p>Some values in the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).</p>

In [4]:
df['FlightNumber'].interpolate(method= 'linear', inplace= True)
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN       10055.0            []   <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis       10075.0          [13]      12. Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [5]:
df['FlightNumber'] = df['FlightNumber'].astype('int64')
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

<h3>Question 2</h3>
<p>The From_To column would be better as two separate columns! Split each string on the underscore delimeter _ to give a new temporary DataFrame with the correct values.Assign the correct column names to this temporary DataFrame.</p>

In [6]:
df2 = pd.DataFrame(index= df.index)

In [7]:
df2['From'] = df['From_To'].str.split('_').str[0]

df2['To'] = df['From_To'].str.split('_').str[1]

df2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

<h3>Question 3</h3>
<p>Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the string so that only the first letter is uppercase (e.g. "londON" should become "London".)</p>

In [8]:
df2['From'] = df2['From'].str.title()

df2['To'] = df2['To'].str.title()

df2

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

<h3>Question 4</h3>
<p>Delete the From_To column from df and attach the temporary DataFrame from the previous questions.</p>

In [9]:
df.drop(labels= 'From_To', axis= 1, inplace= True)

In [10]:
df = pd.concat([df, df2], axis= 1)

df

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []   <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]      12. Air France  Budapest      Paris
4         10085      [67, 32]           Swiss Air  Brussels     London

<h3>Question 5</h3>
<p>In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.<br><br>Expand the series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.</p>

In [11]:
df3 = pd.DataFrame(df['RecentDelays'].to_list(), columns= ['delay_1', 'delay_2', 'delay_3'])
df3

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [12]:
df.drop(labels= 'RecentDelays', axis= 1, inplace= True)
df.insert(loc= 1, column= "Delay_1", value= df3['delay_1'])
df.insert(loc= 2, column= "Delay_2", value= df3['delay_2'])
df.insert(loc= 3, column= "Delay_3", value= df3['delay_3'])

In [13]:
df

,FlightNumber,Delay_1,Delay_2,Delay_3,Airline,From,To
0,10045,23.0,47.0,NaN,KLM(!),London,Paris
1,10055,NaN,NaN,NaN,<Air France> (12),Madrid,Milan
2,10065,24.0,43.0,87.0,(British Airways.),London,Stockholm
3,10075,13.0,NaN,NaN,12. Air France,Budapest,Paris
4,10085,67.0,32.0,NaN,Swiss Air,Brussels,London

---